cf/Documents/РегистрацияКупонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РегистрацияКупонов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СчетчикКупонов</xr:Item>
				<xr:Item>InformationRegister.СкидкиПоКупонам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Купоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Купоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>сколько раз может быть использован купон (одним или несколькими клиентами)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратКупона</Name>
							<Comment>Возможность использовать купон повторно при возврате товара</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКЗакрытию</Name>
							<Comment>количество невостребованных купонов ранее</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Catalogs/Купоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Купоны</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Величина скидки на выбранный товар</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Comment>сумма покупки выбранного товара, обеспечивающая действие купона</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Documents/РегистрацияКупонов/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	         
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	 
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Автор, Ответственный
	|ИЗ
	|	Документ.РегистрацияКупонов
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	 // УСЛОВИЯ ИСПОЛЬЗОВАНИЯ
	 
	|ВЫБРАТЬ
	|	Куп.Ссылка.ДатаНачала 		Период,
	|	Куп.Ссылка.ДатаОкончания 	ДатаОкончания,
	|	Куп.Купон 					Купон,
	|	Тов.Товар 					Товар,
	|	Тов.Ссылка.Сумма            Сумма,
	|	Тов.Ссылка.Порог            Порог
	|ИЗ 
	|	Документ.РегистрацияКупонов.Купоны  Куп
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.Купоны.Товары Тов
	|	ПО 
	|		Куп.Купон = Тов.Ссылка
	|
	|ГДЕ
	|	Куп.Ссылка = &Ссылка
	|;
	// СЧЕТЧИК ИСПОЛЬЗОВАНИЯ
	
	|ВЫБРАТЬ
	|	Ссылка.ДатаНачала 	Период,
	|	&ВидДвиженияПриход 	ВидДвижения,
	|	Купон Купон,
	|	Количество
	|ИЗ 
	|	Документ.РегистрацияКупонов.Купоны  
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	
	ДополнительныеСвойства.Вставить("СкидкиПоКупонам", Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("СчетчикКупонов", Пакет[3].Выгрузить());
	                       
КонецПроцедуры
